yoga416/CH32V307_SmartMedBox_FreeRTOS/User/app_task.c
                if(g_ui_data[uid].update_flags & UI_FLAG_SCHEDULE) {
                    custom_bind_time_labels();
                    if(lv_obj_is_valid(guider_ui.screen_4_label_2))
                        lv_label_set_text_fmt(guider_ui.screen_4_label_2, "Time: %02d:%02d", 
                            g_ui_data[uid].meds_schedule[0].hour, g_ui_data[uid].meds_schedule[0].min);
                    
                    if(lv_obj_is_valid(guider_ui.screen_4_label_20))
                        lv_label_set_text_fmt(guider_ui.screen_4_label_20, "Time: %02d:%02d", 
                            g_ui_data[uid].meds_schedule[1].hour, g_ui_data[uid].meds_schedule[1].min);
                    
                    if(lv_obj_is_valid(guider_ui.screen_4_label_23))
                        lv_label_set_text_fmt(guider_ui.screen_4_label_23, "Time: %02d:%02d", 
                            g_ui_data[uid].meds_schedule[2].hour, g_ui_data[uid].meds_schedule[2].min);


                    /* 3. 同步下拉框选中状态 */
                    if(lv_obj_is_valid(guider_ui.screen_4_ddlist_4)) {
                        uint16_t sel = (g_ui_data[uid].meds_schedule[0].pill_count > 0) ? (g_ui_data[uid].meds_schedule[0].pill_count - 1) : 0;
                        lv_dropdown_set_selected(guider_ui.screen_4_ddlist_4, sel);
                    }
                    if(lv_obj_is_valid(guider_ui.screen_4_ddlist_2)) {
                        uint16_t sel = (g_ui_data[uid].meds_schedule[1].pill_count > 0) ? (g_ui_data[uid].meds_schedule[1].pill_count - 1) : 0;
                        lv_dropdown_set_selected(guider_ui.screen_4_ddlist_2, sel);
                    }
                    if(lv_obj_is_valid(guider_ui.screen_4_ddlist_3)) {
                        uint16_t sel = (g_ui_data[uid].meds_schedule[2].pill_count > 0) ? (g_ui_data[uid].meds_schedule[2].pill_count - 1) : 0;
                        lv_dropdown_set_selected(guider_ui.screen_4_ddlist_3, sel);
                    }
                }

                /*检查是否到吃药时间刷新*/
                if(g_ui_data[uid].update_flags & UI_FLAG_MED_STATUS) 
                {
                if(g_ui_data[uid].screen_3_update_step==true)
                {
                // 5. 刷新吃药状态按钮 (控制 Screen 3 上的按键显示)
                if (lv_obj_is_valid(guider_ui.screen_3_btn_med1)) {
                    if (g_ui_data[uid].med_status[0] == 1) { // 已经吃药
                        if (lv_obj_is_valid(guider_ui.screen_3_btn_med1_label)) 
                            lv_label_set_text(guider_ui.screen_3_btn_med1_label, "已服");
                        lv_obj_add_state(guider_ui.screen_3_btn_med1, LV_STATE_DISABLED); // 禁用按钮
                    } else { // 未吃药
                        if (lv_obj_is_valid(guider_ui.screen_3_btn_med1_label)) 
                            lv_label_set_text(guider_ui.screen_3_btn_med1_label, "吃药");
                        lv_obj_clear_state(guider_ui.screen_3_btn_med1, LV_STATE_DISABLED); // 解除禁用
                    }
                }
                
                if (lv_obj_is_valid(guider_ui.screen_3_btn_med2)) {
                    if (g_ui_data[uid].med_status[1] == 1) {
                        if (lv_obj_is_valid(guider_ui.screen_3_btn_med2_label)) 
                            lv_label_set_text(guider_ui.screen_3_btn_med2_label, "已服");
                        lv_obj_add_state(guider_ui.screen_3_btn_med2, LV_STATE_DISABLED);
                    } else {
                        if (lv_obj_is_valid(guider_ui.screen_3_btn_med2_label)) 
                            lv_label_set_text(guider_ui.screen_3_btn_med2_label, "吃药");
                        lv_obj_clear_state(guider_ui.screen_3_btn_med2, LV_STATE_DISABLED);
                    }
                }

                if (lv_obj_is_valid(guider_ui.screen_3_btn_med3)) {
                    if (g_ui_data[uid].med_status[2] == 1) {
                        if (lv_obj_is_valid(guider_ui.screen_3_btn_med3_label)) 
                            lv_label_set_text(guider_ui.screen_3_btn_med3_label, "已服");
                        lv_obj_add_state(guider_ui.screen_3_btn_med3, LV_STATE_DISABLED);
                    } else {
                        if (lv_obj_is_valid(guider_ui.screen_3_btn_med3_label)) 
                            lv_label_set_text(guider_ui.screen_3_btn_med3_label, "吃药");
                        lv_obj_clear_state(guider_ui.screen_3_btn_med3, LV_STATE_DISABLED);
                    }
                }
            }
            else if(g_ui_data[uid].screen_3_update_step==false)
            {
                if (lv_obj_is_valid(guider_ui.screen_3_label_1)){
               lv_label_set_text(guider_ui.screen_3_label_1, "不在用药时间"); 
                }
            }
        }

           if(g_ui_data[uid].update_flags & UI_FLAG_USER_STEP) 
                {
            if (guider_ui.screen_label_user != NULL) 
            {
                if (uid == 0) {
               lv_label_set_text_fmt(guider_ui.screen_label_user, "User: %d", uid+1);
            } else if (uid == 1) {
                lv_label_set_text_fmt(guider_ui.screen_label_user, "User: %d", uid+1);
            } else if (uid == 2) {
                lv_label_set_text_fmt(guider_ui.screen_label_user, "User: %d", uid+1);
            } 
            }
        }
            //更新城市
            if(g_ui_data[uid].update_flags & UI_FLAG_CITY)
            {
                if (guider_ui.screen_label_city != NULL) 
                {
                    lv_label_set_text_fmt(guider_ui.screen_label_city, "City: %s", g_ui_data[uid].city_name);
                }
            }
            //更新天气
            if(g_ui_data[uid].update_flags & UI_FLAG_WEATHER)
            {
                if (guider_ui.screen_label_weather_icon != NULL) 
                {
                    lv_label_set_text_fmt(guider_ui.screen_label_weather_icon, "weather:%s", g_ui_data[uid].weather);
                }
            }
            //更新温度
            if(g_ui_data[uid].update_flags & UI_FLAG_TEMPERATURE)
            {
                if (guider_ui.screen_label_temperature != NULL) 
                {
                    lv_label_set_text_fmt(guider_ui.screen_label_temperature, "temperature:%d°C", g_ui_data[uid].weather_temp);
                }
            }

             // 刷新完成后，清除更新标志
            g_ui_data[uid].update_flags = 0; 
            xSemaphoreGive(xGuiMutex);
        }
        }

        /*检查是否到吃药时间刷新*/
        /*每10秒检查一次*/
       // 每 10 秒无阻塞触发一次药盒检查
        if (xTaskGetTickCount() - last_check_mechine_time >= pdMS_TO_TICKS(10000)) {
            check_medication_time();
            last_check_mechine_time = xTaskGetTickCount(); // 更新上一次检查的时间
        }
        //设置看门狗事件位，表示 sensor_lcd_task 正常运行
        xEventGroupSetBits(xWatchdogEventGroup, WDOG_BIT_SENSOR_LCD_TASK);
        vTaskDelay(pdMS_TO_TICKS(5)); // 每5ms更新一次 LCD
    }   
}


