yoga416/CH32V307_SmartMedBox_FreeRTOS/User/app_task.c
    memcpy(city_name, rx_packet.payload, copy_len);
    city_name[copy_len] = '\0';
    
    // 安全复制到全局数据
    strncpy(g_ui_data[g_current_active_user_id].city_name, city_name, 
            sizeof(g_ui_data[g_current_active_user_id].city_name) - 1);
    g_ui_data[g_current_active_user_id].city_name[sizeof(g_ui_data[g_current_active_user_id].city_name) - 1] = '\0';
    
    APP_LOG("[Location Sync] City updated to: %s\n", 
            g_ui_data[g_current_active_user_id].city_name);
    
    g_ui_data[g_current_active_user_id].update_flags |= UI_FLAG_CITY;
}

            /*天气同步*/
if (rx_packet.sensor_id == CMD_WEATHER_SYNC && rx_packet.data_len >= 2)
{
    int8_t weather_code = (int8_t)rx_packet.payload[0]; // 天气代码
    int8_t temperature = (int8_t)rx_packet.payload[1];   // 温度
    
    // 心知天气代码映射（0-37常见值）
    switch(weather_code) {
        case 0:  strcpy(g_ui_data[g_current_active_user_id].weather, "Sunny"); break;      // 晴
        case 1:  strcpy(g_ui_data[g_current_active_user_id].weather, "Clear"); break;      // 晴（夜间）
        case 2:  strcpy(g_ui_data[g_current_active_user_id].weather, "Fair"); break;       // 少云
        case 3:  strcpy(g_ui_data[g_current_active_user_id].weather, "Cloudy"); break;     // 多云
        case 4:  strcpy(g_ui_data[g_current_active_user_id].weather, "Overcast"); break;   // 阴天
        
        case 5:  strcpy(g_ui_data[g_current_active_user_id].weather, "Fog"); break;        // 雾
        case 6:  strcpy(g_ui_data[g_current_active_user_id].weather, "Rain"); break;       // 雨
        
        case 7:  strcpy(g_ui_data[g_current_active_user_id].weather, "Snow"); break;       // 雪
        case 8:  strcpy(g_ui_data[g_current_active_user_id].weather, "Snow"); break;       // 雪
        case 9:  strcpy(g_ui_data[g_current_active_user_id].weather, "Snow"); break;       // 雪
        
        case 10: strcpy(g_ui_data[g_current_active_user_id].weather, "Rain"); break;       // 雨
        case 11: strcpy(g_ui_data[g_current_active_user_id].weather, "Rain"); break;       // 雨
        case 12: strcpy(g_ui_data[g_current_active_user_id].weather, "Rain"); break;       // 雨
        case 13: strcpy(g_ui_data[g_current_active_user_id].weather, "Shower"); break;     // 阵雨
        case 14: strcpy(g_ui_data[g_current_active_user_id].weather, "Shower"); break;     // 阵雨
        
        case 15: strcpy(g_ui_data[g_current_active_user_id].weather, "Thunder"); break;    // 雷雨
        case 16: strcpy(g_ui_data[g_current_active_user_id].weather, "Thunder"); break;    // 雷雨
        
        case 17: strcpy(g_ui_data[g_current_active_user_id].weather, "Snow"); break;       // 雪
        case 18: strcpy(g_ui_data[g_current_active_user_id].weather, "Snow"); break;       // 雪
        
        case 19: strcpy(g_ui_data[g_current_active_user_id].weather, "Rain"); break;       // 冻雨
        
        default: strcpy(g_ui_data[g_current_active_user_id].weather, "Unknown"); break;
    }
    
    g_ui_data[g_current_active_user_id].weather_temp = temperature;
    g_ui_data[g_current_active_user_id].update_flags |= UI_FLAG_WEATHER;
    
    APP_LOG("[Weather Sync] Weather: %s (code=%d), Temp: %d°C\n", 
            g_ui_data[g_current_active_user_id].weather, weather_code, temperature);
}

            /*wifi状态更新*/
            if (rx_packet.sensor_id == CMD_WIFI_STATUS_UPDATE)
            {
                
                //APP_LOG("[WiFi] Status update received: 0x%02X\n", rx_packet.payload[0]);
                if(rx_packet.payload[0] == 0x32) {
                    // 接收到心跳包，说明模块在线，更新 WiFi 状态和最后收到状态的时间戳
                    last_wifi_tick = xTaskGetTickCount();
                    g_ui_data[g_current_active_user_id].wifi_status = 0; // 0 表示 WiFi 已连接
                } else {
                    g_ui_data[g_current_active_user_id].wifi_status = 1; // 1 表示 WiFi 断开
                }
                g_ui_data[g_current_active_user_id].update_flags |= UI_FLAG_WIFI; // 触发 UI 刷新
            }
        }
       // ==========================================
        // 3. 独立的心跳超时检测逻辑 (放在接收 if 块的外面)
        // ==========================================
        /* 串口 20s 内没有接收到任何数据时，把 wifi_status 设置为 'F' */
        if(g_ui_data[g_current_active_user_id].wifi_status == 0) 
        {
            if ((xTaskGetTickCount() - last_wifi_tick) >= pdMS_TO_TICKS(20000)) 
            {
                APP_LOG("[WiFi] No status update received for 20s, setting status to 'off'\n");
                g_ui_data[g_current_active_user_id].wifi_status = 1;
                g_ui_data[g_current_active_user_id].update_flags |= UI_FLAG_WIFI; // 触发 UI 刷新
            }
        }
        //设置看门狗事件位，表示 usart_task 正常运行
        xEventGroupSetBits(xWatchdogEventGroup, WDOG_BIT_USART_TASK);
        vTaskDelay(pdMS_TO_TICKS(5));
    }
    }



void vApplicationMallocFailedHook(void)
{
    taskDISABLE_INTERRUPTS();
    APP_LOG("[Error] Malloc Failed\n");
    while (1){}
}

/* 看门狗喂狗任务：定期喂独立看门狗，防止系统卡死 */
void watchdog_task(void *pvParameters)
{
    (void)pvParameters;
    for(;;)
    {
        if(WDOG_BIT_ALL_TASKS == (xEventGroupGetBits(xWatchdogEventGroup) & WDOG_BIT_ALL_TASKS)) {

             IWDG_ReloadCounter(); // 喂独立看门狗
            xEventGroupClearBits(xWatchdogEventGroup, WDOG_BIT_ALL_TASKS); // 清除所有任务位，准备下一轮监测
        }
            vTaskDelay(pdMS_TO_TICKS(100));
    }

}

/*规定时间为前后10分钟*/ // 注：代码里写的是 +/- 1分钟
void check_medication_time(void) {
    RTC_TimeTypeDef current_time;
    BSP_RTC_GetDateTime(&current_time);
    
    int16_t curr_total_mins = current_time.hour * 60 + current_time.min;
    
    Tianwen_Packet_t tw_pkt;
    tw_pkt.data_len = 0;
    
    uint8_t is_time_to_eat = 0; 
    int8_t active_med_idx = -1; // 新增：记录当前是哪一顿药触发了时间
    
    //APP_LOG("[App] Checking medication time... Current time: %02d:%02d\n", current_time.hour, current_time.min);
    
    // 遍历检查设定的3个吃药时间
    for (int i = 0; i < MAX_SCHE; i++) {
        int16_t target_total_mins = my_meds[i].hour * 60 + my_meds[i].min;
        int16_t diff_mins = curr_total_mins - target_total_mins;
        
        // 处理跨天的情况
        if (diff_mins > 12 * 60) diff_mins -= 24 * 60;
        else if (diff_mins < -12 * 60) diff_mins += 24 * 60;
        
        // 只要查到有一顿药在 +/-1 分钟内
        if (diff_mins >= -1 && diff_mins <= 1) {
            is_time_to_eat = 1; 
            active_med_idx = i; // 把当前触发的这顿药的编号记下来
            break; 
        }
    }
    
    if (is_time_to_eat) {
        // 新增：使用静态变量记录上一次重置状态的【日期】和【药品索引】
        static int8_t last_reset_med_idx = -1;
        static uint8_t last_reset_day = 0xFF;

        // 核心判断：如果今天还没有为这顿药重置过状态，才执行重置和存 Flash
        if (last_reset_day != current_time.day || last_reset_med_idx != active_med_idx) {
            
            g_ui_data[g_current_active_user_id].meds_completed[0] = 0;
            g_ui_data[g_current_active_user_id].meds_completed[1] = 0;
            g_ui_data[g_current_active_user_id].meds_completed[2] = 0;

            g_ui_data[g_current_active_user_id].med_status[0] = 0;
            g_ui_data[g_current_active_user_id].med_status[1] = 0;    
            g_ui_data[g_current_active_user_id].med_status[2] = 0;    
            
            /*并保存到Flash*/
            SystemData_Save_To_Flash_ByUser(g_current_active_user_id);
            
            // 更新记录，打上“已处理”的标签
            last_reset_med_idx = active_med_idx;
            last_reset_day = current_time.day;

             g_ui_data[g_current_active_user_id].screen_3_update_step = true;  
            tw_pkt.id = CMD_TX_TIME_TO_EAT; 
        }

        // 下面这些 UI 刷新和语音指令，依然每次都执行，保证在这 3 分钟内屏幕一直停留在吃药界面
       
    } else {
        g_ui_data[g_current_active_user_id].screen_3_update_step = false;  
    }
    
    // 统一发送一次队列消息
    xQueueSend(sendtianwenQueue, &tw_pkt, 0); 
}